In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [117]:
df=pd.DataFrame({'Name':['Aqib','Riyan','Zoheb','Zamam','Shoaib'],
                'Age':[18,20,23,21,25],
                'Residence':['Bandra','Kurla','Dadar','Andheri','Malad'],
                'Salary':[50000,55000,65000,58000,6000]})

In [118]:
df

     Name  Age Residence  Salary
0    Aqib   18    Bandra   50000
1   Riyan   20     Kurla   55000
2   Zoheb   23     Dadar   65000
3   Zamam   21   Andheri   58000
4  Shoaib   25     Malad    6000

In [119]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   21.400000  46800.000000
std     2.701851  23445.681905
min    18.000000   6000.000000
25%    20.000000  50000.000000
50%    21.000000  55000.000000
75%    23.000000  58000.000000
max    25.000000  65000.000000

In [120]:
df.groupby('Age')['Salary'].sum()

Age
18    50000
20    55000
21    58000
23    65000
25     6000
Name: Salary, dtype: int64

In [121]:
df.drop(['Age'],axis=1)

     Name Residence  Salary
0    Aqib    Bandra   50000
1   Riyan     Kurla   55000
2   Zoheb     Dadar   65000
3   Zamam   Andheri   58000
4  Shoaib     Malad    6000

In [122]:
df.sort_values(['Salary'],ascending=False)

     Name  Age Residence  Salary
2   Zoheb   23     Dadar   65000
3   Zamam   21   Andheri   58000
1   Riyan   20     Kurla   55000
0    Aqib   18    Bandra   50000
4  Shoaib   25     Malad    6000

In [123]:
df.insert(1,'Surname',['Ansari','Shaikh','Shaikh','Ansari','Khan'])

In [124]:
df

     Name Surname  Age Residence  Salary
0    Aqib  Ansari   18    Bandra   50000
1   Riyan  Shaikh   20     Kurla   55000
2   Zoheb  Shaikh   23     Dadar   65000
3   Zamam  Ansari   21   Andheri   58000
4  Shoaib    Khan   25     Malad    6000

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
def reindex_df(df):
    new_idx=range(1,len(df)*2+1,2)
    df.index=new_idx
    return df

In [8]:
df3=pd.DataFrame({"A":[1,2,3],"B":[4,5,6],"C":[7,8,9]})

In [9]:
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
reindex_df(df3)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [11]:
df4=pd.DataFrame({"Values":[10,20,30,40,50,60]})

In [12]:
def df_sum(df):
    ans=0
    for i in range(3):
        ans+=df['Values'][i]
    return ans

In [13]:
df_sum(df4)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [14]:
df5=pd.DataFrame({'Text':["Kohli","Dhawan","MSD"]})

In [15]:
df5['Word_count']=df5['Text'].apply(lambda x:len(x))

In [16]:
df5

     Text  Word_count
0   Kohli           5
1  Dhawan           6
2     MSD           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans) DataFrame.shape() gives number of rows and columns and DataFrame.size() gives product of number of rows and number of columns.

In [17]:
df.shape

(2, 5)

In [18]:
df.size

10

Q6. Which function of pandas do we use to read an excel file?

Ans)pd.read_excel

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [19]:
df6=pd.DataFrame({"Email":["aqibansari@gmail.com","iNeuron@gmail.com","PWskills@gmail.com"]})

In [20]:
df6

                  Email
0  aqibansari@gmail.com
1     iNeuron@gmail.com
2    PWskills@gmail.com

In [21]:
def extract_name(df):
    df['Username']=df['Email'].apply(lambda x:x.split('@')[0])
    return df

In [22]:
extract_name(df6)

                  Email    Username
0  aqibansari@gmail.com  aqibansari
1     iNeuron@gmail.com     iNeuron
2    PWskills@gmail.com    PWskills

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [23]:
df7=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [24]:
df7

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [25]:
df7[(df7['A']>5) & (df7['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [26]:
df8=pd.DataFrame({'Values':[12,34,23,54,36,43,19]})

In [27]:
def df_calc(df):
    a=df['Values'].mean()
    b=df['Values'].median()
    c=df['Values'].std()
    return f"Mean={a} | Median={b} | Standard deviation={c}"

In [28]:
df_calc(df8)

'Mean=31.571428571428573 | Median=34.0 | Standard deviation=14.570027943889272'

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [82]:
df11=pd.DataFrame({"Date":pd.date_range(start='2023-01-01',end='2023-01-31'),
             "sales":[i*100 for i in range(31)]})

In [85]:
df11['Moving Average']=df11['sales'].rolling(window=7,).mean()

In [86]:
df11

         Date  sales  Moving Average
0  2023-01-01      0             NaN
1  2023-01-02    100             NaN
2  2023-01-03    200             NaN
3  2023-01-04    300             NaN
4  2023-01-05    400             NaN
5  2023-01-06    500             NaN
6  2023-01-07    600           300.0
7  2023-01-08    700           400.0
8  2023-01-09    800           500.0
9  2023-01-10    900           600.0
10 2023-01-11   1000           700.0
11 2023-01-12   1100           800.0
12 2023-01-13   1200           900.0
13 2023-01-14   1300          1000.0
14 2023-01-15   1400          1100.0
15 2023-01-16   1500          1200.0
16 2023-01-17   1600          1300.0
17 2023-01-18   1700          1400.0
18 2023-01-19   1800          1500.0
19 2023-01-20   1900          1600.0
20 2023-01-21   2000          1700.0
21 2023-01-22   2100          1800.0
22 2023-01-23   2200          1900.0
23 2023-01-24   2300          2000.0
24 2023-01-25   2400          2100.0
25 2023-01-26   2500          2200.0
26 2023-01-27   2600          2300.0
27 2023-01-28   2700          2400.0
28 2023-01-29   2800          2500.0
29 2023-01-30   2900          2600.0
30 2023-01-31   3000          2700.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [29]:
df9=pd.DataFrame({'date':pd.date_range(start='2023-01-01',end='2023-01-05')})

In [30]:
df9

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [31]:
df9['Weekday']=df9['date'].apply(lambda x:x.day_name())

In [32]:
df9

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [87]:
df10=pd.DataFrame({"Date":pd.date_range(start='2023-01-01',end='2023-02-20')})

In [ ]:
def date_rows(df):
    a=(df['Date']>'2023-01-01') & (df['Date']<'2023-01-31')
    return df.loc[a]

In [56]:
date_rows(df10)

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans) pandas library